#+TITLE: Introduction to Emacs
#+AUTHOR: Max Vigdorchik
#+OPTIONS: toc:nil

*** Org mode actually lets you run code from most languages directly in the buffer, making it the best implementation of literate programming
#+BEGIN_SRC python
mylist = [i**2 for i in range(1,10)]
return mylist #By default org mode treats the code block as a single function, but that can be changed
#+END_SRC

#+RESULTS:
| 1 | 4 | 9 | 16 | 25 | 36 | 49 | 64 | 81 |

#+BEGIN_SRC perl6
my $var = 1;
my $var2 = 12;
return $var + $var2;
#+END_SRC

#+RESULTS:
: 13

#+BEGIN_SRC elisp
(+ (* 5 5) (+ 192 17))
#+END_SRC

#+RESULTS:
: 234

